#+TITLE: BSU
#+AUTHOR: Justin Johnson

*BOLD*
_UNDERLINE_
=VERBATIM=
~CODE~
/ITALIC/

*** INPROGRESS Consult Advisor to finalize Spring schedule
	SCHEDULED: <2018-10-22 Mon 10:00>
	| Course    | Description                         | Credits | Instructors            |
	|-----------+-------------------------------------+---------+------------------------|
	| UF 200    | Foundations of Ethics and Diversity |       3 |                        |
	| CS 361    | Intro to Theory of Comp             |       3 |                        |
	| CS 441    | Computer Architecture               |       3 |                        |
	| CS 453    | Operating Systems                   |       3 | Shane Panter/Amit jain |
	| CS-HU 271 | Agile Developement                  |       1 |                        |
	| ***         | Work U                              |      3  |                        |
	| ^         | Total:                              |      13 |                        |
	#+TBLFM: $3=vsum(@2..@-1)
******** Attack
#+NAME: Why it works (Partial Key Exposure Attack Proof)
#+BEGIN_EXAMPLE 
Ex1:	
	5 = 2 mod 3
	5 = 1*3 + 2
Ex2:
	17 = 2 mod 3
	17 = 5*3 + 2
Ex3:
	d = e mod n
	d = n*k + e :for some k

d 	= 1/e mod phi(n)
d*e = 1 mod phi(n)
e*d	= k*phi(n) + 1
UNKNOWNS:	phi(n),k,d
KNOWNS:		n,e
"Well-Known" AM-GM inequality shows:
	2sqrt(xy) <= x + y
! This can be used to approximate phi(n)
	phi(n) 	= (p-1)(q-1)
			= pq - (p+q) + 1 <= pq - 2sqrt(pq) + 1
			<= n - 2sqrt(n) + 1
			*Note equality sign flipped by mult. of -1
	e*dk	= k*phi(n) + 1 //where Dk is smoe approximation of d (private key)
		therefore
	*For k < d define:
	Dk 		= (k*phi(n) + 1)/e //note that phi(n) is our approximation as shown above
	
	if we have the last m digits of d, (Least significant portion), we can
	substitute L (least significant portion) to improve our approximation
	of Dk by replacing the LSD (Least Significant Digits) of Dk with L.
	
#+END_EXAMPLE

#+NAME:  Partial Key Exposure Attack
#+BEGIN_SRC sage
########################################################################################
# The function takes in the requested inputs and computes a decryption key             #
# If there are not enough digits in the input the function will tell you so            #
########################################################################################

def partial (R, e, partd):
    m = 1000
    E = m.powermod(e,R)#&^(m, s) % R
    for k in range(1, e * 10000):
        Dk = math.floor((k * (R - 2 * isqrt(R) + 1) + 1) / e)
        l=(partd).ndigits()
        Dk=Dk-(Dk % 10^l)+partd
        mm = E.powermod(Dk,R)#E&^Dk mod R:
        if m == mm:
            return(Dk)
    print("not enough digits to discover d")

R=1030794365305576815134103206958049837943419896523;
e=17873;
partd=6816907735531628355014100526810177;
Dd=partial(R,e,partd);
Dd

p = next_prime(776213649127364987123648972364987123648972316498623197124356715324065713526)
q = next_prime(2345545654565456654512374619287364981723648972163984612983461912386)
N = p*q
phiN = (p-1)*(q-1)
e = 17
e
while gcd(e,phiN)!=1: e+=1
d = 1/e % phiN
d
partialD = 1452930806742028080905133750698038297318124171383735131021465946217038961017925194270324213877445652376073
Dd=partial(N,e,partialD);
Dd
#+END_SRC

#+RESULTS: Partial Key Exposure Attack
: not enough digits to discover d
: 17
: 749677168357388769334958802538629561452930806742028080905133750698038297318124171383735131021465946217038961017925194270324213877445652376073
: not enough digits to discover d

****** ATTACKS: ISATTACK
#+NAME: InitialSegment Attack Small q
#+BEGIN_SRC sage
def ISAttack (R):
    n = R.ndigits()
    #n = len(R)
    for j in range(1, n + 1):
        x=(R-(R % 10^j))/10^j
        p = gcd(x, R)
        if ((1 < p)and (p<R)):
            return(p)
    print "nonefound"

# Choose large prime with many consecutive zeros
p=next_prime(1213000000000000000000000000000000000000000000000000000000000000124)
p
# Choose prime with less digits than p has zeros
q=next_prime(1234567890)
q
# COmputer n=p*q
n=p*q
n
# Apply ISAttack
p=ISAttack(n)
p
#+END_SRC
#+RESULTS: InitialSegment Attack
: 1213000000000000000000000000000000000000000000000000000000000000291
: 1234567891
: 1497530851783000000000000000000000000000000000000000000000000000359259256281
: 1234567891

#+NAME: InitialSegment Large q
#+BEGIN_SRC sage
def ISAttack (R):
    n = R.ndigits()
    #n = len(R)
    for j in range(1, n + 1):
        x=(R-(R % 10^j))/10^j
        p = gcd(x, R)
        if ((1 < p)and (p<R)):
            return(p)
    print "nonefound"

# Choose large prime p with many consecutive zeros
p=next_prime(1000000000000000000000000000002347239472938749237492837498237984237987237498792831)
p
# Choose large q
q=next_prime(196327349823794238791247612374689213649218736498)
q
# Compute n=p*q
n=p*q
n
p=ISAttack(n)
p
#+END_SRC
#+RESULTS: InitialSegment Large q
: 1000000000000000000000000000002347239472938749237492837498237984237987237498793079
: 196327349823794238791247612374689213649218736623
: 196327349823794238791247612375150040954342600855043086369924757982661461133718474657040466537331025478920476913721120235676232217
: nonefound

*** In-Class Examples/Practice
#+NAME: Iterated Encryption
#+BEGIN_SRC sage

# RSA - Encryption Procedures=========
def rsaencrypt(Message, encrexp, encrmod, rounds):
    if (rounds <= 0): return Message
    A=Message
    E = power_mod(A,encrexp,encrmod);
    return rsaencrypt(E,encrexp,encrmod, rounds-1)
#=====================================

# Blackboard:LectureNotes:Lecture11:Example
# REMEMBER: E1=M^e mod n
# Where M-plaintext and E-ciphertext
# ^^ 1st encryption vv 2nd encryption
# E2=E1^e mod n

# Encryption Modulus:
n=315562173921131111550753275258954314886929684614433857059068225329589007516900986203500713113234143069878550293
# Encryption Exponent:
e=1835588100642725811278316299646156385857628660058608776628872255463681001129596115865795858135978837517124882698892069345209251312769967638417909171551219459094621692202465346003400944724101186482909006146466321559204641
# Ciphertext:
E=150598315159426420417362370315760759643687452249127260593893330249875774660837569082216166241764228321707042114

E=rsaencrypt(E,e,n,10)
E
#+END_SRC

#+RESULTS: Iterated Encryption
: 150598315159426420417362370315760759643687452249127260593893330249875774660837569082216166241764228321707042114

***** Solution
#+NAME: Assignment 6: Fermat Attack
#+BEGIN_SRC sage 
# Function Definitions
# REF: Blackboard Software (rsadecrypt)
def ASCIIDepad(Number):
    n = Number.ndigits() % 3;
    if (n > 0):
        print("This is not a padded ASCII string\n");
    else:
        L = [((Number - (Number % (1000^i)))/1000^i)%1000 - 100 for i in range(Number.ndigits()/3)];
        N = "";
        for i in range(Number.ndigits()/3):
            N = chr(L[i]) + N;
        return(N)

def rsadecrypt(encr,decrexp,encrmod):
    D = power_mod(encr,decrexp,encrmod);
    N = ASCIIDepad(D);
    return(N);


# From Blackboard Software Sources (Fermat Attack)
def isqrt(n):
    return int(floor(sqrt(n)))

def usqrt (n):
    ur = isqrt(n)
    if ur ** 2 < n:
        ur = ur + 1
    return(ur)

def FermatAttack (n, rounds):
    st = usqrt(n)
    for x in range(st, st + rounds + 1):
        #print (x-st)
        sq = x ** 2 - n
        y = isqrt(sq)
        if y ** 2 == sq:
            print "Factor found in round {0}".format(x-st+1)
            return(x + y)
    print "No factor found in {0} rounds".format(rounds)

# Define Problem information into code
# aliceKey=(R/n,e) where R or n is the modulos
aliceKey=(3200909051105364201164693808053590029074088922158723491051061550603549823737458227601881401901569257978004143012923593331603179164497963879113975835000986070024699519343049991253001543465847139349037243656109687211847515003135028132545450689475582835433024130454351048493271288284326740872991312817737068756145723348616748658487242931184584005382638341 ,45938274932874982748938989492800101)
n=aliceKey[0]
e=aliceKey[1]
bobM=1646965299225077453528764533325484870128106736546137408200095456059067040313170132659677309326733627254170824177278689792967869683703210102631692715251241388457103568881887427174337319839702934337074114069079964028787201219122008132800911350242389943062437915595376659222211331548822861710469042657218207369516502014847384607200570429591504554077212313

# Try a Fermat Attack on bob's message
p=FermatAttack(n,10)
p
# Find the prime factors of n
q=aliceKey[0]/p
phi=(p-1)*(q-1)

# compute private key
t=inverse_mod(e,phi)
t
	
# Attempt to decrypt the message
D=rsadecrypt(bobM, t, n)
D

print("\nSolutions:\n")
print("The message is {}\n".format(D))
print("The private key is {}\n".format(t))
print("The value of phi(R) is {}\n".format(phi))
print("Factors of R are {} and {}\n".format(p,q))

#+END_SRC

#+RESULTS: Assignment 6: Fermat Attack
#+begin_example
Factor found in round 1
56576576876878687676755667454534349837593827932875983275983759382759287237567887987980908998787786767565645454533423423343243546576576876879879879879878687675765644535434287237L
3167863510034742237627997195928786583153512307937169989597828968058877017293250922100187347305076307004322384676497222811128113753424625921466939826882160195180303741752185273650841791717876895004244979963739993488694617994141773778317684342636200808646316120457410025841816142247504391080136501066088010574604519661347572707772349904352818684682371437
'Identity Based Cryptosystems'

Solutions:

The message is Identity Based Cryptosystems

The private key is 31678635100347422376279971959287865831535123079371699895978
289680588770172932509221001873473050763070043223846764972228111281137534246259
214669398268821601951803037417521852736508417917178768950042449799637399934886
946179941417737783176843426362008086463161204574100258418161422475043910801365
01066088010574604519661347572707772349904352818684682371437

The value of phi(R) is 32009090511053642011646938080535900290740889221587234910
510615506035498237374582276018814019015692579780041430129235933316031791644979
638791139758350009860700246995193430499911398483897120897639955259087470409875
366598591373830615805779319239570083602972481544925330509176977531530358318061
44466131249975602991969588856988898729867579653294934514074112

Factors of R are 5657657687687868767675566745453434983759382793287598327598375
938275928723756788798798090899878778676756564545453342342334324354657657687687
9879879879878687675765644535434287237 
and 
565765768768786876767556674545343498375938279328759832759837593827592872375678
879879809089987877867675656454545334234233432435465765768768798798798798786876
75765644535434276993
#+end_example

***** Notes
	  *I accidently deleted stuff...missing notes and files*
#+NAME: Function Pointers
#+HEADER: :dir ./src/c
#+HEADER: :file functionPointers.txt
#+HEADER: :tangle ./src/c/functionPointers.c
#+BEGIN_SRC C :includes '(<stdio.h> <stdlib.h>)
printf("Hello World");
#+END_SRC

#+RESULTS: Function Pointers
: DEBUG: Entering a string/function foo!

